Repository: raydocs/tono
Catalog: apps/macos/Tono/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Starting Kill Switch…
zh_hans: 正在开启断网保护…

source: Starting core
zh_hans: 正在启动核心

source: Starting protected tunnel…
zh_hans: 正在启动保护隧道…

source: State, logs and recovery steps support may ask you for.
zh_hans: 技术支持可能会向你索取的状态、日志与恢复步骤。

source: Stopped
zh_hans: 已停止

source: Stopping the protected tunnel…
zh_hans: 正在停止保护隧道…

source: Subs
zh_hans: 订阅

source: Subscription URL is invalid
zh_hans: 订阅链接无效

source: Subscription content is not valid text
zh_hans: 订阅内容不是有效文本

source: Subscription server returned HTTP %lld
zh_hans: 订阅服务器返回 HTTP %lld

source: Subscription server returned an HTML page instead of a config file. Please check the link.
zh_hans: 订阅服务器返回了 HTML 页面而非配置文件，请检查链接。

source: Subscription source refused access. Import nodes via "Import from Clash Verge" or "Import File" first, then update the subscription after connecting the proxy.
zh_hans: 订阅源拒绝访问。请先通过「从 Clash Verge 导入」或「文件导入」获取节点，连接代理后再更新订阅。

source: Support
zh_hans: 支持

source: Support & Diagnostics
zh_hans: 支持与诊断

source: Support reference
zh_hans: 支持编号

source: Switch
zh_hans: 切换

source: Switched to %@
zh_hans: 已切换到 %@

source: Switching server…
zh_hans: 正在切换节点…

source: System Proxy
zh_hans: 系统代理

source: System Summary
zh_hans: 系统概要

source: System events (helper, Kill Switch, reconnects) are kept in the local audit log.
zh_hans: 系统事件（网络组件、断网保护、重连）记录在本地审计日志中。

source: System proxy could not be turned off. Disable the proxy manually in System Settings > Network.
zh_hans: 系统代理关闭失败，请在系统设置 > 网络中手动关闭代理。

source: System proxy failed: %@. Core is running but traffic is NOT proxied.
zh_hans: 系统代理设置失败：%@。核心正在运行，但流量并未走代理。

source: System proxy lost: %@
zh_hans: 系统代理丢失：%@

source: System proxy: %@
zh_hans: 系统代理：%@

source: System-wide display language
zh_hans: 应用显示语言

source: System-wide traffic capture
zh_hans: 虚拟网卡全局接管流量

source: TARGET POLICY
zh_hans: 目标策略

source: TIME
zh_hans: 时间

source: TLS server name
zh_hans: TLS 服务器名称

source: TOTAL %llds
zh_hans: 总计 %lld秒

source: TRY %lld
zh_hans: 第 %lld 次

source: TUN Mode
zh_hans: TUN 模式

source: TUN active
zh_hans: TUN 已启用

source: TUN missing
zh_hans: TUN 缺失

source: TUN mode disabled. Reconnect to apply.
zh_hans: TUN 模式已关闭，重新连接后生效。

source: TUN mode will take effect after reconnecting.
zh_hans: TUN 模式将在重新连接后生效。

source: TYPE
zh_hans: 类型

source: Taking longer than usual — still checking your session and network helper.
zh_hans: 耗时比预期长——仍在检查你的会话与网络组件。

source: Tap to connect
zh_hans: 点按连接

source: Tap to connect via %@
zh_hans: 点按连接到 %@

source: Tap to disconnect
zh_hans: 点按断开

source: Tap to restore internet
zh_hans: 点按恢复上网

source: Target Node / Group
zh_hans: 目标节点/分组

source: Target Policy
zh_hans: 目标策略

source: Tell Tono support when this app crashed
zh_hans: 应用崩溃时告知 Tono 技术支持

source: Test Latency
zh_hans: 测试延迟

source: Test current exit
zh_hans: 测试当前节点

source: The Tono home transport stopped and no managed cloud exit is available. Internet remains blocked by the kill switch.
zh_hans: 家宽线路已中断，而且现在没有可用的云端节点。断网保护仍在拦住直接上网。

source: The active network changed; Kill Switch is blocking traffic while Tono protects the new connection.
zh_hans: 当前网络已切换。断网保护正在阻断流量，Tono 正在保护新的连接。

source: The authenticated helper did not start.
zh_hans: 已认证的网络组件未能启动。

source: The authenticated network helper is unavailable.
zh_hans: 已认证的网络组件不可用。

source: The connection attempt stalled and was stopped.
zh_hans: 连接尝试长时间无进展，已停止。

source: The current device cannot revoke itself.
zh_hans: 当前设备无法撤销自己。

source: The installed network helper no longer accepts this copy of Tono. Click Retry and approve the administrator prompt to repair it, or run the documented sudo emergency-disarm command and reopen Tono. %@
zh_hans: 已安装的网络组件不再接受这份 Tono。点按「重试」并在管理员弹窗中确认以修复，或运行文档中的 sudo 紧急解除命令后重新打开 Tono。%@

source: The installed network helper rejected this copy of Tono.
zh_hans: 已安装的网络组件拒绝了这份 Tono。

source: The macOS protected DNS path did not pass its end-to-end check.
zh_hans: macOS 的受保护 DNS 通道未通过端到端检查。

source: The network helper closed the connection.
zh_hans: 网络组件关闭了连接。

source: The network helper returned an invalid response.
zh_hans: 网络组件返回了无效响应。

source: The requested item no longer exists.
zh_hans: 请求的对象已不存在。

source: The same failure repeated three times, so automatic retries are paused. Tap Retry Now to try again, or Protected Offline to restore normal Internet.
zh_hans: 同一错误已连续出现三次，自动重试已暂停。点按「立即重试」再试一次，或点按「恢复正常网络」恢复上网。

source: The selected cloud server was removed. Kill Switch is still blocking traffic; choose another cloud server.
zh_hans: 所选云端节点已被移除。断网保护仍在拦住直连，请另选一个云端节点。

source: The selected cloud server was removed. Tono switched to the managed default cloud server.
zh_hans: 所选云端节点已被移除，Tono 已切换到受管的默认云端节点。

source: The selected node is unavailable.
zh_hans: 所选节点当前不可用。

source: Theme
zh_hans: 外观

source: Theme Mode
zh_hans: 主题模式

source: This Mac
zh_hans: 这台 Mac

source: This Mac has no network connection. Protection resumes automatically when the network returns.
zh_hans: 当前物理网络不可用。网络恢复后会自动继续保护。

source: This Mac is still using Encrypted DNS or iCloud Private Relay, so apps bypass Tono's protected resolver. Turn Encrypted DNS and Private Relay off, then reconnect.
zh_hans: 这台 Mac 仍在使用加密 DNS 或 iCloud 私密转发，应用会绕过 Tono 的受保护解析器。请关闭加密 DNS 与私密转发，然后重新连接。

source: This Tono account cannot connect
zh_hans: 此 Tono 账户无法连接

source: This Tono account has reached its device allowance. Revoke another device first.
zh_hans: 此 Tono 账户已达到设备数量上限，请先撤销另一台设备。

source: This Tono account is not active. Contact Tono support to restore access.
zh_hans: 此 Tono 账户当前不可用，请联系 Tono 客服恢复访问。

source: This Tono plan has expired. Renew it to keep connecting.
zh_hans: 此 Tono 套餐已到期，续费后即可继续连接。

source: This Tono plan has used its full data allowance.
zh_hans: 此 Tono 套餐的流量额度已用完。

source: This account does not have permission for that action.
zh_hans: 此账户没有执行该操作的权限。

source: This device
zh_hans: 这台设备

source: This is exactly what Tono reports when support requests a diagnostic snapshot. It carries no hostnames, IP addresses, process names or account tokens.
zh_hans: 这就是技术支持索取诊断快照时 Tono 会上报的全部内容，其中不含主机名、IP 地址、进程名或账号令牌。

source: This is exactly what Tono reports when support requests a diagnostic snapshot. It carries no hostnames, IP addresses, process names or account tokens. It is a separate, smaller report than the audit log above, which in this test build is uploaded in full.
zh_hans: 这正是支持团队请求诊断快照时 Tono 上报的内容。其中不含主机名、IP 地址、进程名或账号令牌。它与上面的审计日志是两份不同的报告，体积更小；审计日志在这个测试版本中会被完整上传。

source: This is what Tono reports when support requests a diagnostic snapshot, followed by the catalog and traffic-policy state the uploaded snapshot has no field for. It carries no hostnames, IP addresses, process names or account tokens. It is a separate, smaller report than the audit log above, which in this test build is uploaded in full.
zh_hans: 这是支持团队索取诊断快照时 Tono 会上报的内容，后面附上了上传的快照没有字段承载的目录与分流策略状态。其中不含主机名、IP 地址、进程名或账户令牌。它与上面的审计日志是两份不同的报告，后者在此测试版本中会被完整上传。

source: Throughput over the last minute
zh_hans: 最近一分钟的吞吐量

source: Timeout
zh_hans: 超时

source: To work reliably, Tono must run from the Applications folder. Quit Tono, drag it onto Applications in the installer window, then open the installed copy.
zh_hans: 为确保 Tono 稳定运行，必须从「应用程序」文件夹启动。请退出 Tono，在安装窗口中将它拖到「应用程序」，然后打开已安装的副本。

source: Tokyo
zh_hans: 东京

source: Tono Account
zh_hans: Tono 账户

source: Tono Protection
zh_hans: Tono 保护

source: Tono account suspended
zh_hans: Tono 账户已被停用

source: Tono could not release a protection state left by an earlier session. Run the documented sudo emergency-disarm command, then reopen Tono. %@
zh_hans: Tono 无法解除上一次会话遗留的保护状态。请运行文档中的 sudo 紧急解除命令，然后重新打开 Tono。%@

source: Tono does not expose the protected route to LAN clients.
zh_hans: Tono 不会把受保护线路开放给局域网客户端。

source: Tono has to quit and reopen to change languages. This Mac is protected right now, so the connection is dropped and Kill Switch is released until you connect again.
zh_hans: 更改语言需要退出并重新打开 Tono。这台 Mac 当前处于受保护状态，连接会被断开，断网保护也会解除，直到你再次连接。

source: Tono keeps Rule mode locked so traffic cannot bypass the protected cloud route.
zh_hans: Tono 锁定规则模式，以防流量绕过受保护的云端线路。

source: Tono keeps one local, redacted log file. Support may call it the audit log or the diagnostics log — it is the same file. Credentials and URL queries are removed before anything is written.
zh_hans: Tono 只保留一份本地脱敏日志。技术支持可能称它为审计日志或诊断日志——指的是同一个文件。凭据与 URL 查询参数在写入前已被移除。

source: Tono keeps one redacted log file. Support may call it the audit log or the diagnostics log — it is the same file. Credentials and URL queries are removed before anything is written, and TLS bodies are never observed. In this test build the file is also uploaded to Tono support so routing bugs can be diagnosed without asking you for it; it carries the hostnames you connected to, the process that opened each connection, and which rule and route it matched. Settings › Privacy turns the upload off.
zh_hans: Tono 只保留一份已脱敏的日志文件。支持团队可能称它为审计日志或诊断日志——是同一份文件。凭据和 URL 查询参数在写入前已被移除，TLS 内容从不被读取。在这个测试版本中，该文件还会上传给 Tono 支持团队，以便无需向你索取即可排查路由问题；其中包含你连接过的主机名、发起每条连接的进程，以及命中的规则与路由。可在「设置 › 隐私」中关闭上传。

source: Tono may ask for administrator access to install its signed network helper — this is what routes and protects your traffic.
zh_hans: Tono 可能会请求管理员权限来安装签名网络组件——它负责路由并保护你的流量。

source: Tono quit unexpectedly on %@ · %@ · build %@
zh_hans: Tono 曾于 %1$@ 意外退出 · %2$@ · 构建 %3$@

source: Tono requires TUN mode while cloud protection is active.
zh_hans: 云端保护启用期间，Tono 必须使用 TUN 模式。

source: Tono returned an invalid response.
zh_hans: Tono 返回了无效响应。

source: Tono service is not configured.
zh_hans: Tono 服务尚未配置。

source: Tono sign-in is temporarily unavailable.
zh_hans: Tono 登录暂时不可用。

source: Tono's network helper needs repair before protection can be released, so your traffic stays protected. Choose Restore internet again and approve the administrator prompt. If repair keeps failing, the Support page has a recovery command. %@
zh_hans: Tono 的网络助手需要修复后才能解除保护，你的流量仍处于保护中。请再次选择「恢复联网」并在管理员提示中授权。若修复持续失败，支持页面提供了一条恢复命令。%@

source: Tono's network helper rejected this copy of Tono, so automatic retries are paused. Choose Repair and reconnect to reinstall the helper, or Restore internet to turn protection off. If repair keeps failing, the Support page has a recovery command.
zh_hans: Tono 的网络助手拒绝了当前这份 Tono，自动重试已暂停。请选择「修复并重新连接」以重新安装助手，或选择「恢复正常网络」以关闭保护。若修复反复失败，「支持与诊断」页面提供了恢复命令。

source: Total
zh_hans: 合计

source: Traffic by route · this session
zh_hans: 本会话流量 · 按线路

source: Traffic is routed
zh_hans: 流量已走受保护线路

source: Traffic policy
zh_hans: 分流策略

source: Traffic policy refresh failed
zh_hans: 分流策略刷新失败

source: Try a different search or region filter.
zh_hans: 请尝试其他搜索词或地区筛选。

source: Tunnel
zh_hans: 隧道

source: Turn this on in Settings › Privacy.
zh_hans: 请在「设置 › 隐私」中开启。

# Type label
source: Type
zh_hans: 类型

source: URL Test
zh_hans: 自动测速

source: Unavailable
zh_hans: 不可用

source: Unknown · the helper did not answer
zh_hans: 未知 · 助手未响应

source: Update All
zh_hans: 全部更新

source: Updated
zh_hans: 已更新

source: Updated cloud route failed; Kill Switch is blocking traffic while Tono retries. %@
zh_hans: 更新后的云端线路启用失败。断网保护正在阻断流量，Tono 正在重试。%@

source: Updates
zh_hans: 更新

source: Upload
zh_hans: 上传

source: Upload failed. %@
zh_hans: 上传失败。%@

source: Upload now
zh_hans: 立即上传

source: Upload run finished. Nothing is sent when the log has not advanced since the last upload.
zh_hans: 上传已执行。若日志自上次上传后没有新增内容，则不会发送任何内容。

source: Usage
zh_hans: 用量

source: Use this only when Tono cannot repair its network helper and the internet stays blocked after you quit Tono: it clears the helper's leftover network rules so the Mac connects normally again.
zh_hans: 仅在 Tono 无法修复其网络助手、且退出 Tono 后网络仍被阻断时使用：它会清除助手残留的网络规则，让这台 Mac 恢复正常联网。

source: User
zh_hans: 用户

source: Username
zh_hans: 用户名

source: Using last verified catalog
zh_hans: 正在使用上一次已验证的目录

source: Using last verified copy
zh_hans: 正在使用上一次已验证的副本

source: VALUE
zh_hans: 值

source: VLESS UUID is required
zh_hans: 必须填写 VLESS UUID

source: Value
zh_hans: 值

source: Verified catalog
zh_hans: 已验证的目录

source: Verified server catalog
zh_hans: 已验证的节点目录

source: Verifying traffic protection…
zh_hans: 正在验证流量保护…

# Version %@ (%@)
source: Version %1$@ (%2$@)
zh_hans: 版本 %1$@（%2$@）

source: Virtual network adapter for system-wide proxy
zh_hans: 虚拟网卡全局代理

source: Waiting for server catalog
zh_hans: 正在等待节点目录

source: Waiting for the first traffic sample…
zh_hans: 等待第一笔流量…

source: Waiting for the protected route after wake; Internet remains blocked.
zh_hans: 唤醒后正在等待受保护线路，网络仍处于阻断状态。

source: Waiting to retry…
zh_hans: 正在等待重试…

source: Wake protection is still being reasserted; Internet remains blocked. %@
zh_hans: 唤醒后的保护仍在重新生效，网络仍处于阻断状态。%@

source: Warning
zh_hans: 警告

source: WebRTC leak check
zh_hans: WebRTC 泄漏检查

source: Website
zh_hans: 官网

source: Welcome to Tono
zh_hans: 欢迎使用 Tono

source: What failed
zh_hans: 失败原因

source: Your %lld-device allowance is full. Sign in and revoke another device if needed.
zh_hans: 你的 %lld 台设备额度已用满。请登录后移除其中一台设备。

source: Your session has expired. Please sign in again.
zh_hans: 会话已过期，请重新登录。

source: active
zh_hans: 使用中

source: connecting
zh_hans: 连接中

source: e.g. google.com, 192.168.0.0/16, CN
zh_hans: 例如 google.com、192.168.0.0/16、CN

source: mihomo core binary not found
zh_hans: 找不到 mihomo 核心文件

source: of %lld
zh_hans: 共 %lld 个

source: or
zh_hans: 或

source: unavailable
zh_hans: 不可用

source: ✓ %lld nodes
zh_hans: ✓ %lld 个节点

# ✓ %lld nodes, %lld rules
source: ✓ %1$lld nodes, %2$lld rules
zh_hans: ✓ %1$lld 个节点，%2$lld 条规则

source: ✓ Updated %lld nodes
zh_hans: ✓ 已更新 %lld 个节点

source: Claude / AI Residential Route: Active
zh_hans: Claude / AI 住宅专线：已就绪

source: Standard Cloud Protection (Data Center)
zh_hans: 基础专线保护（数据中心）

source: Claude web, API, Claude Code, and verification use dedicated residential exit
zh_hans: Claude 网页、API、Claude Code 及人机验证走独立家庭宽带

source: All traffic routed through selected cloud node
zh_hans: 全部流量走所选云端节点

source: View Rules
zh_hans: 查看规则

source: Claude / AI Residential Protection Scope
zh_hans: Claude / AI 住宅专线保护范围

source: The following traffic is transparently captured via TUN virtual adapter and forwarded through high-reputation residential broadband exits to prevent IP flagging: • Anthropic Core Services: *.anthropic.com, *.claude.ai • Cloudflare Turnstile Verification: challenges.cloudflare.com, cf-assets.www.cloudflare.com • Telemetry & Feature Flags: *.datadoghq.com, *.statsigapi.net, *.stripe.network • Local Developer Apps: Claude Code CLI, Claude Desktop Zero terminal configuration required.
zh_hans: 以下流量通过纯 TUN 虚拟网卡透明接管，并通过高信用家庭宽带跳点转发，免除数据中心 IP 风控： • Anthropic 核心服务：*.anthropic.com, *.claude.ai • 人机安全验证：challenges.cloudflare.com, cf-assets.www.cloudflare.com • 遥测与灰度：*.datadoghq.com, *.statsigapi.net, *.stripe.network • 本地应用进程：Claude Code、Claude Desktop 终端零代理配置，开箱即用。

source: Claude Code / Terminal Environment Diagnostics
zh_hans: Claude Code / 终端开发环境体检

source: Proxy Residue Detected
zh_hans: 发现代理残留

source: Environment Ready
zh_hans: 环境就绪

source: Residual HTTP_PROXY environment variables detected. This often causes terminal tools (like Claude Code CLI) to fail with connection refused.
zh_hans: 检测到系统或进程中存在残留代理配置。这可能导致终端软件（如 Claude Code CLI）报错并拒绝连接。

source: System environment variables are clean. Terminal traffic is transparently routed via Tono TUN virtual adapter. Claude Code, git, npm, and pip work out-of-the-box without manual proxy configuration.
zh_hans: 终端环境正常。流量直接由 Tono TUN 虚拟网卡透明接管，Claude Code、git、npm、pip 开箱即用，无需配置代理。

source: Checking terminal proxy sources…
zh_hans: 正在检查终端代理来源…

source: Some terminal proxy sources could not be inspected. Tono will not report the environment as ready until the scan completes.
zh_hans: 部分终端代理来源无法检查。扫描完整完成前，Tono 不会将环境报告为就绪。

source: Scan Incomplete
zh_hans: 扫描不完整

source: Clear uppercase and lowercase proxy variables in a new shell: unset HTTP_PROXY HTTPS_PROXY ALL_PROXY http_proxy https_proxy all_proxy
zh_hans: 在新 shell 中清除大写和小写代理变量：unset HTTP_PROXY HTTPS_PROXY ALL_PROXY http_proxy https_proxy all_proxy

source: After fixing every listed source, fully restart Tono, open terminals, VS Code, and Claude Code together with any supervisor or parent process that launched it.
zh_hans: 修复所有列出的来源后，请彻底重启 Tono、已打开的终端、VS Code、Claude Code，以及启动它的 supervisor 或父进程。

source: Inspection errors
zh_hans: 检查错误

source: Current Tono GUI process
zh_hans: 当前 Tono GUI 进程

source: Current launchctl GUI environment
zh_hans: 当前 launchctl GUI 环境

source: Remove the inherited variable from its parent source. Include lowercase proxy names when unsetting it.
zh_hans: 从父级来源移除继承变量；清除时也要包含小写代理变量名。

source: Run launchctl unsetenv for this exact proxy key, then fully restart Tono, VS Code, every terminal, Claude Code, and its supervisor.
zh_hans: 对这个代理变量执行 launchctl unsetenv，然后彻底重启 Tono、VS Code、所有终端、Claude Code 及其后台管理进程。

source: Remove only this proxy assignment; preserve all unrelated profile content. Then restart the terminal and Claude supervisor.
zh_hans: 只移除此代理赋值，保留 profile 中所有无关内容，然后重启终端和 Claude supervisor。

source: Claude managed settings
zh_hans: Claude 托管设置

source: Claude managed preferences
zh_hans: Claude 托管偏好设置

source: Claude settings
zh_hans: Claude 设置

source: Claude project settings
zh_hans: Claude 项目设置

source: Remove the proxy key from the managed Claude settings source, then fully restart Claude Code and its supervisor.
zh_hans: 从 Claude 托管设置来源中移除代理键，然后彻底重启 Claude Code 及其 supervisor。

source: Remove the proxy key from the env object, then fully restart Claude Code and its supervisor.
zh_hans: 从 env 对象中移除代理键，然后彻底重启 Claude Code 及其 supervisor。

source: Remove the proxy key from the project env object, then fully restart Claude Code and its supervisor.
zh_hans: 从项目 env 对象中移除代理键，然后彻底重启 Claude Code 及其 supervisor。

source: Remove the proxy key from terminal.integrated.env.osx, then fully restart VS Code and every integrated terminal.
zh_hans: 从 terminal.integrated.env.osx 中移除代理键，然后彻底重启 VS Code 和每个集成终端。

source: VS Code user settings
zh_hans: VS Code 用户设置

source: VS Code profile settings
zh_hans: VS Code 配置文件设置

source: All browser profiles share Tono's routing. Tono only reads these settings; it never changes browser preferences or routes an entire browser process.
zh_hans: 所有浏览器配置文件共用 Tono 的路由。Tono 只读取这些设置；它不会更改浏览器偏好设置，也不会按整个浏览器进程路由。

source: Blocking
zh_hans: 阻断

source: Browser Secure DNS
zh_hans: 浏览器安全 DNS

source: Checking Chrome and Microsoft Edge…
zh_hans: 正在检查 Chrome 和 Microsoft Edge…

source: Chrome and Microsoft Edge use Tono's protected system DNS.
zh_hans: Chrome 和 Microsoft Edge 正在使用 Tono 受保护的系统 DNS。

source: Chrome or Microsoft Edge may bypass Tono's protected DNS. Turn off Secure DNS in Chrome and Edge for all profiles, fully restart the browsers, then reconnect.
zh_hans: Chrome 或 Microsoft Edge 可能绕过 Tono 的受保护 DNS。请在 Chrome 和 Edge 的所有配置文件中关闭安全 DNS，彻底重启浏览器，然后重新连接。

source: Secure DNS can bypass Tono. Turn it off in Chrome and Edge for all profiles, fully restart the browsers, then reconnect.
zh_hans: 安全 DNS 可能绕过 Tono。请在 Chrome 和 Edge 的所有配置文件中关闭它，彻底重启浏览器，然后重新连接。

source: The browser DNS scan was incomplete. Tono fails closed when a residential Claude route is configured.
zh_hans: 浏览器 DNS 扫描未完成。配置 Claude 住宅线路时，Tono 会以故障关闭方式阻止连接。

source: browser-wide settings
zh_hans: 浏览器全局设置

source: machine managed policy
zh_hans: 设备托管策略

source: not installed / no browser state
zh_hans: 未安装 / 无浏览器状态

source: user managed policy
zh_hans: 用户托管策略

source: VS Code workspace settings
zh_hans: VS Code 工作区设置
